In [8]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect("hr.db")

In [10]:
sql = '''SELECT employee_id, first_name||' '||last_name AS Name, hire_date, salary
    FROM employees;'''
df = pd.read_sql_query(sql, conn)
conn.close()

In [11]:
df.head()

   employee_id              Name            hire_date  salary
0          100       Steven King  2003-06-17 00:00:00   24000
1          101     Neena Kochhar  2005-09-21 00:00:00   17000
2          102       Lex De Haan  2001-01-13 00:00:00   17000
3          103  Alexander Hunold  2006-01-03 00:00:00    9000
4          104       Bruce Ernst  2007-05-21 00:00:00    6000

In [12]:
df.tail()

     employee_id             Name            hire_date  salary
102          202          Pat Fay  2005-08-17 00:00:00    6000
103          203     Susan Mavris  2002-06-07 00:00:00    6500
104          204     Hermann Baer  2002-06-07 00:00:00   10000
105          205  Shelley Higgins  2002-06-07 00:00:00   12008
106          206    William Gietz  2002-06-07 00:00:00    8300